espressif/arduino-esp32/boards.txt
esp32thing_plus.build.f_cpu=240000000L
esp32thing_plus.build.flash_mode=dio
esp32thing_plus.build.flash_size=16MB
esp32thing_plus.build.boot=dio
esp32thing_plus.build.partitions=default
esp32thing_plus.build.defines=

esp32thing_plus.menu.FlashFreq.80=80MHz
esp32thing_plus.menu.FlashFreq.80.build.flash_freq=80m
esp32thing_plus.menu.FlashFreq.40=40MHz
esp32thing_plus.menu.FlashFreq.40.build.flash_freq=40m

esp32thing_plus.menu.PartitionScheme.default=Default (6.25MB APP/OTA/3.43MB SPIFFS)
esp32thing_plus.menu.PartitionScheme.default.build.partitions=default_16MB
esp32thing_plus.menu.PartitionScheme.default.upload.maximum_size=6553600
esp32thing_plus.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/OTA/6.93MB SPIFFS)
esp32thing_plus.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
esp32thing_plus.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592

esp32thing_plus.menu.UploadSpeed.921600=921600
esp32thing_plus.menu.UploadSpeed.921600.upload.speed=921600
esp32thing_plus.menu.UploadSpeed.115200=115200
esp32thing_plus.menu.UploadSpeed.115200.upload.speed=115200
esp32thing_plus.menu.UploadSpeed.256000.windows=256000
esp32thing_plus.menu.UploadSpeed.256000.upload.speed=256000
esp32thing_plus.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32thing_plus.menu.UploadSpeed.230400=230400
esp32thing_plus.menu.UploadSpeed.230400.upload.speed=230400
esp32thing_plus.menu.UploadSpeed.460800.linux=460800
esp32thing_plus.menu.UploadSpeed.460800.macosx=460800
esp32thing_plus.menu.UploadSpeed.460800.upload.speed=460800
esp32thing_plus.menu.UploadSpeed.512000.windows=512000
esp32thing_plus.menu.UploadSpeed.512000.upload.speed=512000

esp32thing_plus.menu.DebugLevel.none=None
esp32thing_plus.menu.DebugLevel.none.build.code_debug=0
esp32thing_plus.menu.DebugLevel.error=Error
esp32thing_plus.menu.DebugLevel.error.build.code_debug=1
esp32thing_plus.menu.DebugLevel.warn=Warn
esp32thing_plus.menu.DebugLevel.warn.build.code_debug=2
esp32thing_plus.menu.DebugLevel.info=Info
esp32thing_plus.menu.DebugLevel.info.build.code_debug=3
esp32thing_plus.menu.DebugLevel.debug=Debug
esp32thing_plus.menu.DebugLevel.debug.build.code_debug=4
esp32thing_plus.menu.DebugLevel.verbose=Verbose
esp32thing_plus.menu.DebugLevel.verbose.build.code_debug=5

esp32thing_plus.menu.EraseFlash.none=Disabled
esp32thing_plus.menu.EraseFlash.none.upload.erase_cmd=
esp32thing_plus.menu.EraseFlash.all=Enabled
esp32thing_plus.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32thing_plus_c.name=SparkFun ESP32 Thing Plus C

esp32thing_plus_c.bootloader.tool=esptool_py
esp32thing_plus_c.bootloader.tool.default=esptool_py

esp32thing_plus_c.upload.tool=esptool_py
esp32thing_plus_c.upload.tool.default=esptool_py
esp32thing_plus_c.upload.tool.network=esp_ota

esp32thing_plus_c.upload.maximum_size=1310720
esp32thing_plus_c.upload.maximum_data_size=327680
esp32thing_plus_c.upload.wait_for_upload_port=true
esp32thing_plus_c.upload.flags=
esp32thing_plus_c.upload.extra_flags=

esp32thing_plus_c.serial.disableDTR=true
esp32thing_plus_c.serial.disableRTS=true

esp32thing_plus_c.build.tarch=xtensa
esp32thing_plus_c.build.bootloader_addr=0x1000
esp32thing_plus_c.build.target=esp32
esp32thing_plus_c.build.mcu=esp32
esp32thing_plus_c.build.core=esp32
esp32thing_plus_c.build.variant=esp32thing_plus_c
esp32thing_plus_c.build.board=ESP32_THING_PLUS_C

esp32thing_plus_c.build.f_cpu=240000000L
esp32thing_plus_c.build.flash_mode=dio
esp32thing_plus_c.build.flash_size=16MB
esp32thing_plus_c.build.boot=dio
esp32thing_plus_c.build.partitions=default
esp32thing_plus_c.build.defines=

esp32thing_plus_c.menu.FlashFreq.80=80MHz
esp32thing_plus_c.menu.FlashFreq.80.build.flash_freq=80m
esp32thing_plus_c.menu.FlashFreq.40=40MHz
esp32thing_plus_c.menu.FlashFreq.40.build.flash_freq=40m

esp32thing_plus_c.menu.PartitionScheme.default=Default (6.25MB APP/OTA/3.43MB SPIFFS)
esp32thing_plus_c.menu.PartitionScheme.default.build.partitions=default_16MB
esp32thing_plus_c.menu.PartitionScheme.default.upload.maximum_size=6553600
esp32thing_plus_c.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/OTA/6.93MB SPIFFS)
esp32thing_plus_c.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
esp32thing_plus_c.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592

esp32thing_plus_c.menu.UploadSpeed.921600=921600
esp32thing_plus_c.menu.UploadSpeed.921600.upload.speed=921600
esp32thing_plus_c.menu.UploadSpeed.115200=115200
esp32thing_plus_c.menu.UploadSpeed.115200.upload.speed=115200
esp32thing_plus_c.menu.UploadSpeed.256000.windows=256000
esp32thing_plus_c.menu.UploadSpeed.256000.upload.speed=256000
esp32thing_plus_c.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32thing_plus_c.menu.UploadSpeed.230400=230400
esp32thing_plus_c.menu.UploadSpeed.230400.upload.speed=230400
esp32thing_plus_c.menu.UploadSpeed.460800.linux=460800
esp32thing_plus_c.menu.UploadSpeed.460800.macosx=460800
esp32thing_plus_c.menu.UploadSpeed.460800.upload.speed=460800
esp32thing_plus_c.menu.UploadSpeed.512000.windows=512000
esp32thing_plus_c.menu.UploadSpeed.512000.upload.speed=512000

esp32thing_plus_c.menu.DebugLevel.none=None
esp32thing_plus_c.menu.DebugLevel.none.build.code_debug=0
esp32thing_plus_c.menu.DebugLevel.error=Error
esp32thing_plus_c.menu.DebugLevel.error.build.code_debug=1
esp32thing_plus_c.menu.DebugLevel.warn=Warn
esp32thing_plus_c.menu.DebugLevel.warn.build.code_debug=2
esp32thing_plus_c.menu.DebugLevel.info=Info
esp32thing_plus_c.menu.DebugLevel.info.build.code_debug=3
esp32thing_plus_c.menu.DebugLevel.debug=Debug
esp32thing_plus_c.menu.DebugLevel.debug.build.code_debug=4
esp32thing_plus_c.menu.DebugLevel.verbose=Verbose
esp32thing_plus_c.menu.DebugLevel.verbose.build.code_debug=5

esp32thing_plus_c.menu.EraseFlash.none=Disabled
esp32thing_plus_c.menu.EraseFlash.none.upload.erase_cmd=
esp32thing_plus_c.menu.EraseFlash.all=Enabled
esp32thing_plus_c.menu.EraseFlash.all.upload.erase_cmd=-e

