espressif/arduino-esp32/boards.txt
lolin_s3_mini.menu.USBMode.hwcdc=Hardware CDC and JTAG
lolin_s3_mini.menu.USBMode.hwcdc.build.usb_mode=1
lolin_s3_mini.menu.USBMode.default=USB-OTG (TinyUSB)
lolin_s3_mini.menu.USBMode.default.build.usb_mode=0

lolin_s3_mini.menu.CDCOnBoot.default=Disabled
lolin_s3_mini.menu.CDCOnBoot.default.build.cdc_on_boot=0
lolin_s3_mini.menu.CDCOnBoot.cdc=Enabled
lolin_s3_mini.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

lolin_s3_mini.menu.MSCOnBoot.default=Disabled
lolin_s3_mini.menu.MSCOnBoot.default.build.msc_on_boot=0
lolin_s3_mini.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lolin_s3_mini.menu.MSCOnBoot.msc.build.msc_on_boot=1

lolin_s3_mini.menu.DFUOnBoot.default=Disabled
lolin_s3_mini.menu.DFUOnBoot.default.build.dfu_on_boot=0
lolin_s3_mini.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lolin_s3_mini.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lolin_s3_mini.menu.UploadMode.default=UART0 / Hardware CDC
lolin_s3_mini.menu.UploadMode.default.upload.use_1200bps_touch=false
lolin_s3_mini.menu.UploadMode.default.upload.wait_for_upload_port=false
lolin_s3_mini.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lolin_s3_mini.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lolin_s3_mini.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lolin_s3_mini.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
lolin_s3_mini.menu.PartitionScheme.default.build.partitions=default
lolin_s3_mini.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
lolin_s3_mini.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
lolin_s3_mini.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
lolin_s3_mini.menu.PartitionScheme.no_ota.build.partitions=no_ota
lolin_s3_mini.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lolin_s3_mini.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
lolin_s3_mini.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
lolin_s3_mini.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
lolin_s3_mini.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
lolin_s3_mini.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
lolin_s3_mini.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
lolin_s3_mini.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
lolin_s3_mini.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
lolin_s3_mini.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
lolin_s3_mini.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
lolin_s3_mini.menu.PartitionScheme.huge_app.build.partitions=huge_app
lolin_s3_mini.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
lolin_s3_mini.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
lolin_s3_mini.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lolin_s3_mini.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
lolin_s3_mini.menu.PartitionScheme.rainmaker=RainMaker
lolin_s3_mini.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lolin_s3_mini.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

lolin_s3_mini.menu.CPUFreq.240=240MHz (WiFi)
lolin_s3_mini.menu.CPUFreq.240.build.f_cpu=240000000L
lolin_s3_mini.menu.CPUFreq.160=160MHz (WiFi)
lolin_s3_mini.menu.CPUFreq.160.build.f_cpu=160000000L
lolin_s3_mini.menu.CPUFreq.80=80MHz (WiFi)
lolin_s3_mini.menu.CPUFreq.80.build.f_cpu=80000000L
lolin_s3_mini.menu.CPUFreq.40=40MHz
lolin_s3_mini.menu.CPUFreq.40.build.f_cpu=40000000L
lolin_s3_mini.menu.CPUFreq.20=20MHz
lolin_s3_mini.menu.CPUFreq.20.build.f_cpu=20000000L
lolin_s3_mini.menu.CPUFreq.10=10MHz
lolin_s3_mini.menu.CPUFreq.10.build.f_cpu=10000000L

lolin_s3_mini.menu.UploadSpeed.921600=921600
lolin_s3_mini.menu.UploadSpeed.921600.upload.speed=921600
lolin_s3_mini.menu.UploadSpeed.115200=115200
lolin_s3_mini.menu.UploadSpeed.115200.upload.speed=115200
lolin_s3_mini.menu.UploadSpeed.256000.windows=256000
lolin_s3_mini.menu.UploadSpeed.256000.upload.speed=256000
lolin_s3_mini.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin_s3_mini.menu.UploadSpeed.230400=230400
lolin_s3_mini.menu.UploadSpeed.230400.upload.speed=230400
lolin_s3_mini.menu.UploadSpeed.460800.linux=460800
lolin_s3_mini.menu.UploadSpeed.460800.macosx=460800
lolin_s3_mini.menu.UploadSpeed.460800.upload.speed=460800
lolin_s3_mini.menu.UploadSpeed.512000.windows=512000
lolin_s3_mini.menu.UploadSpeed.512000.upload.speed=512000

lolin_s3_mini.menu.DebugLevel.none=None
lolin_s3_mini.menu.DebugLevel.none.build.code_debug=0
lolin_s3_mini.menu.DebugLevel.error=Error
lolin_s3_mini.menu.DebugLevel.error.build.code_debug=1
lolin_s3_mini.menu.DebugLevel.warn=Warn
lolin_s3_mini.menu.DebugLevel.warn.build.code_debug=2
lolin_s3_mini.menu.DebugLevel.info=Info
lolin_s3_mini.menu.DebugLevel.info.build.code_debug=3
lolin_s3_mini.menu.DebugLevel.debug=Debug
lolin_s3_mini.menu.DebugLevel.debug.build.code_debug=4
lolin_s3_mini.menu.DebugLevel.verbose=Verbose
lolin_s3_mini.menu.DebugLevel.verbose.build.code_debug=5

lolin_s3_mini.menu.EraseFlash.none=Disabled
lolin_s3_mini.menu.EraseFlash.none.upload.erase_cmd=
lolin_s3_mini.menu.EraseFlash.all=Enabled
lolin_s3_mini.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lolin_s3_pro.name=LOLIN S3 Pro
lolin_s3_pro.vid.0=0x303a
lolin_s3_pro.pid.0=0x8161

lolin_s3_pro.bootloader.tool=esptool_py
lolin_s3_pro.bootloader.tool.default=esptool_py

lolin_s3_pro.upload.tool=esptool_py
lolin_s3_pro.upload.tool.default=esptool_py
lolin_s3_pro.upload.tool.network=esp_ota

lolin_s3_pro.upload.maximum_size=1310720
lolin_s3_pro.upload.maximum_data_size=327680
lolin_s3_pro.upload.flags=
lolin_s3_pro.upload.extra_flags=
lolin_s3_pro.upload.use_1200bps_touch=false
lolin_s3_pro.upload.wait_for_upload_port=false

lolin_s3_pro.serial.disableDTR=false
lolin_s3_pro.serial.disableRTS=false

lolin_s3_pro.build.tarch=xtensa
lolin_s3_pro.build.bootloader_addr=0x0
lolin_s3_pro.build.target=esp32s3
lolin_s3_pro.build.mcu=esp32s3
lolin_s3_pro.build.core=esp32
lolin_s3_pro.build.variant=lolin_s3_pro
lolin_s3_pro.build.board=LOLIN_S3_PRO

lolin_s3_pro.build.usb_mode=1
lolin_s3_pro.build.cdc_on_boot=0
lolin_s3_pro.build.msc_on_boot=0
lolin_s3_pro.build.dfu_on_boot=0
lolin_s3_pro.build.f_cpu=240000000L
lolin_s3_pro.build.flash_size=16MB
lolin_s3_pro.build.flash_freq=80m
lolin_s3_pro.build.flash_mode=dio
lolin_s3_pro.build.boot=qio
lolin_s3_pro.build.boot_freq=80m
lolin_s3_pro.build.partitions=default
lolin_s3_pro.build.defines=-DBOARD_HAS_PSRAM
lolin_s3_pro.build.loop_core=
lolin_s3_pro.build.event_core=
lolin_s3_pro.build.psram_type=opi
lolin_s3_pro.build.memory_type={build.boot}_{build.psram_type}

