espressif/arduino-esp32/boards.txt
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.921600=921600
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.115200=115200
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.230400=230400
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32s3_nopsram.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32s3_nopsram.menu.DebugLevel.none=None
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.error=Error
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.info=Info
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s3_nopsram.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s3_nopsram.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s3_nopsram.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s3_nopsram.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s3_nopsram.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Feather ESP32-S3 TFT

adafruit_feather_esp32s3_tft.name=Adafruit Feather ESP32-S3 TFT
adafruit_feather_esp32s3_tft.vid.0=0x239A
adafruit_feather_esp32s3_tft.pid.0=0x811D
adafruit_feather_esp32s3_tft.vid.1=0x239A
adafruit_feather_esp32s3_tft.pid.1=0x011D
adafruit_feather_esp32s3_tft.vid.2=0x239A
adafruit_feather_esp32s3_tft.pid.2=0x811E

adafruit_feather_esp32s3_tft.bootloader.tool=esptool_py
adafruit_feather_esp32s3_tft.bootloader.tool.default=esptool_py

adafruit_feather_esp32s3_tft.upload.tool=esptool_py
adafruit_feather_esp32s3_tft.upload.tool.default=esptool_py
adafruit_feather_esp32s3_tft.upload.tool.network=esp_ota

adafruit_feather_esp32s3_tft.upload.maximum_size=1310720
adafruit_feather_esp32s3_tft.upload.maximum_data_size=327680
adafruit_feather_esp32s3_tft.upload.flags=
adafruit_feather_esp32s3_tft.upload.extra_flags=
adafruit_feather_esp32s3_tft.upload.use_1200bps_touch=true
adafruit_feather_esp32s3_tft.upload.wait_for_upload_port=true

adafruit_feather_esp32s3_tft.serial.disableDTR=false
adafruit_feather_esp32s3_tft.serial.disableRTS=false

adafruit_feather_esp32s3_tft.build.tarch=xtensa
adafruit_feather_esp32s3_tft.build.bootloader_addr=0x0
adafruit_feather_esp32s3_tft.build.target=esp32s3
adafruit_feather_esp32s3_tft.build.mcu=esp32s3
adafruit_feather_esp32s3_tft.build.core=esp32
adafruit_feather_esp32s3_tft.build.variant=adafruit_feather_esp32s3_tft
adafruit_feather_esp32s3_tft.build.board=ADAFRUIT_FEATHER_ESP32S3_TFT

adafruit_feather_esp32s3_tft.build.usb_mode=0
adafruit_feather_esp32s3_tft.build.cdc_on_boot=1
adafruit_feather_esp32s3_tft.build.msc_on_boot=0
adafruit_feather_esp32s3_tft.build.dfu_on_boot=0
adafruit_feather_esp32s3_tft.build.f_cpu=240000000L
adafruit_feather_esp32s3_tft.build.flash_size=4MB
adafruit_feather_esp32s3_tft.build.flash_freq=80m
adafruit_feather_esp32s3_tft.build.flash_mode=dio
adafruit_feather_esp32s3_tft.build.boot=qio
adafruit_feather_esp32s3_tft.build.partitions=default
adafruit_feather_esp32s3_tft.build.defines=
adafruit_feather_esp32s3_tft.build.loop_core=
adafruit_feather_esp32s3_tft.build.event_core=
adafruit_feather_esp32s3_tft.build.flash_type=qio
adafruit_feather_esp32s3_tft.build.psram_type=qspi
adafruit_feather_esp32s3_tft.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_feather_esp32s3_tft.menu.LoopCore.1=Core 1
adafruit_feather_esp32s3_tft.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_feather_esp32s3_tft.menu.LoopCore.0=Core 0
adafruit_feather_esp32s3_tft.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_feather_esp32s3_tft.menu.EventsCore.1=Core 1
adafruit_feather_esp32s3_tft.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_feather_esp32s3_tft.menu.EventsCore.0=Core 0
adafruit_feather_esp32s3_tft.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_feather_esp32s3_tft.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_feather_esp32s3_tft.menu.USBMode.default.build.usb_mode=0
adafruit_feather_esp32s3_tft.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_feather_esp32s3_tft.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_feather_esp32s3_tft.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s3_tft.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s3_tft.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s3_tft.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s3_tft.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s3_tft.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s3_tft.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3_tft.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s3_tft.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s3_tft.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s3_tft.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3_tft.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s3_tft.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_feather_esp32s3_tft.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_feather_esp32s3_tft.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_feather_esp32s3_tft.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_feather_esp32s3_tft.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_feather_esp32s3_tft.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_feather_esp32s3_tft.menu.PSRAM.enabled=QSPI PSRAM
adafruit_feather_esp32s3_tft.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_feather_esp32s3_tft.menu.PSRAM.enabled.build.psram_type=qspi
adafruit_feather_esp32s3_tft.menu.PSRAM.disabled=Disabled
adafruit_feather_esp32s3_tft.menu.PSRAM.disabled.build.defines=
adafruit_feather_esp32s3_tft.menu.PSRAM.disabled.build.psram_type=qspi
adafruit_feather_esp32s3_tft.menu.PSRAM.opi=OPI PSRAM
adafruit_feather_esp32s3_tft.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_feather_esp32s3_tft.menu.PSRAM.opi.build.psram_type=opi

adafruit_feather_esp32s3_tft.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FATFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_feather_esp32s3_tft.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-4MB-tinyuf2
adafruit_feather_esp32s3_tft.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_feather_esp32s3_tft.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_feather_esp32s3_tft.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.default.build.partitions=default
adafruit_feather_esp32s3_tft.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_feather_esp32s3_tft.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_feather_esp32s3_tft.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_feather_esp32s3_tft.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_feather_esp32s3_tft.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_feather_esp32s3_tft.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_feather_esp32s3_tft.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_feather_esp32s3_tft.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_feather_esp32s3_tft.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_feather_esp32s3_tft.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

