espressif/arduino-esp32/boards.txt
adafruit_qtpy_esp32_pico.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32_pico.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_qtpy_esp32_pico.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

adafruit_qtpy_esp32_pico.menu.CPUFreq.240=240MHz (WiFi/BT)
adafruit_qtpy_esp32_pico.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.160=160MHz (WiFi/BT)
adafruit_qtpy_esp32_pico.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.80=80MHz (WiFi/BT)
adafruit_qtpy_esp32_pico.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32_pico.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32_pico.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32_pico.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32_pico.menu.FlashFreq.80=80MHz
adafruit_qtpy_esp32_pico.menu.FlashFreq.80.build.flash_freq=80m
adafruit_qtpy_esp32_pico.menu.FlashFreq.40=40MHz
adafruit_qtpy_esp32_pico.menu.FlashFreq.40.build.flash_freq=40m

adafruit_qtpy_esp32_pico.menu.FlashSize.8M=8MB (64Mb)
adafruit_qtpy_esp32_pico.menu.FlashSize.8M.build.flash_size=8MB

adafruit_qtpy_esp32_pico.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32_pico.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32_pico.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32_pico.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32_pico.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32_pico.menu.DebugLevel.none=None
adafruit_qtpy_esp32_pico.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32_pico.menu.DebugLevel.error=Error
adafruit_qtpy_esp32_pico.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32_pico.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32_pico.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32_pico.menu.DebugLevel.info=Info
adafruit_qtpy_esp32_pico.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32_pico.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32_pico.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32_pico.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32_pico.menu.DebugLevel.verbose.build.code_debug=5

adafruit_qtpy_esp32_pico.menu.EraseFlash.none=Disabled
adafruit_qtpy_esp32_pico.menu.EraseFlash.none.upload.erase_cmd=
adafruit_qtpy_esp32_pico.menu.EraseFlash.all=Enabled
adafruit_qtpy_esp32_pico.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit QT Py ESP32-C3

adafruit_qtpy_esp32c3.name=Adafruit QT Py ESP32-C3
adafruit_qtpy_esp32c3.vid.0=0x303a
adafruit_qtpy_esp32c3.pid.0=0x1001

adafruit_qtpy_esp32c3.bootloader.tool=esptool_py
adafruit_qtpy_esp32c3.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32c3.upload.tool=esptool_py
adafruit_qtpy_esp32c3.upload.tool.default=esptool_py
adafruit_qtpy_esp32c3.upload.tool.network=esp_ota

adafruit_qtpy_esp32c3.upload.maximum_size=1310720
adafruit_qtpy_esp32c3.upload.maximum_data_size=327680
adafruit_qtpy_esp32c3.upload.flags=
adafruit_qtpy_esp32c3.upload.extra_flags=
adafruit_qtpy_esp32c3.upload.use_1200bps_touch=false
adafruit_qtpy_esp32c3.upload.wait_for_upload_port=false

adafruit_qtpy_esp32c3.serial.disableDTR=false
adafruit_qtpy_esp32c3.serial.disableRTS=false

adafruit_qtpy_esp32c3.build.tarch=riscv32
adafruit_qtpy_esp32c3.build.bootloader_addr=0x0
adafruit_qtpy_esp32c3.build.target=esp
adafruit_qtpy_esp32c3.build.mcu=esp32c3
adafruit_qtpy_esp32c3.build.core=esp32
adafruit_qtpy_esp32c3.build.variant=adafruit_qtpy_esp32c3
adafruit_qtpy_esp32c3.build.board=ADAFRUIT_QTPY_ESP32C3

adafruit_qtpy_esp32c3.build.cdc_on_boot=1
adafruit_qtpy_esp32c3.build.f_cpu=160000000L
adafruit_qtpy_esp32c3.build.flash_size=4MB
adafruit_qtpy_esp32c3.build.flash_freq=80m
adafruit_qtpy_esp32c3.build.flash_mode=dio
adafruit_qtpy_esp32c3.build.boot=qio
adafruit_qtpy_esp32c3.build.partitions=default
adafruit_qtpy_esp32c3.build.defines=

adafruit_qtpy_esp32c3.menu.CDCOnBoot.cdc=Enabled
adafruit_qtpy_esp32c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_qtpy_esp32c3.menu.CDCOnBoot.default=Disabled
adafruit_qtpy_esp32c3.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_qtpy_esp32c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.default.build.partitions=default
adafruit_qtpy_esp32c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_qtpy_esp32c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_qtpy_esp32c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_qtpy_esp32c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_qtpy_esp32c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_qtpy_esp32c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_qtpy_esp32c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_qtpy_esp32c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_qtpy_esp32c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_qtpy_esp32c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_qtpy_esp32c3.menu.CPUFreq.160=160MHz (WiFi)
adafruit_qtpy_esp32c3.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32c3.menu.CPUFreq.80=80MHz (WiFi)
adafruit_qtpy_esp32c3.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32c3.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32c3.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32c3.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32c3.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32c3.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32c3.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32c3.menu.FlashMode.qio=QIO
adafruit_qtpy_esp32c3.menu.FlashMode.qio.build.flash_mode=dio
adafruit_qtpy_esp32c3.menu.FlashMode.qio.build.boot=qio
adafruit_qtpy_esp32c3.menu.FlashMode.dio=DIO
adafruit_qtpy_esp32c3.menu.FlashMode.dio.build.flash_mode=dio
adafruit_qtpy_esp32c3.menu.FlashMode.dio.build.boot=dio

adafruit_qtpy_esp32c3.menu.FlashFreq.80=80MHz
adafruit_qtpy_esp32c3.menu.FlashFreq.80.build.flash_freq=80m
adafruit_qtpy_esp32c3.menu.FlashFreq.40=40MHz
adafruit_qtpy_esp32c3.menu.FlashFreq.40.build.flash_freq=40m

