espressif/arduino-esp32/boards.txt
##############################################################

m5stack-fire.name=M5Stack-FIRE

m5stack-fire.bootloader.tool=esptool_py
m5stack-fire.bootloader.tool.default=esptool_py

m5stack-fire.upload.tool=esptool_py
m5stack-fire.upload.tool.default=esptool_py
m5stack-fire.upload.tool.network=esp_ota

m5stack-fire.upload.maximum_size=6553600
m5stack-fire.upload.maximum_data_size=4521984
m5stack-fire.upload.flags=
m5stack-fire.upload.extra_flags=

m5stack-fire.serial.disableDTR=true
m5stack-fire.serial.disableRTS=true

m5stack-fire.build.tarch=xtensa
m5stack-fire.build.bootloader_addr=0x1000
m5stack-fire.build.target=esp32
m5stack-fire.build.mcu=esp32
m5stack-fire.build.core=esp32
m5stack-fire.build.variant=m5stack_fire
m5stack-fire.build.board=M5STACK_FIRE

m5stack-fire.build.f_cpu=240000000L
m5stack-fire.build.flash_size=16MB
m5stack-fire.build.flash_freq=80m
m5stack-fire.build.flash_mode=dio
m5stack-fire.build.boot=dio
m5stack-fire.build.partitions=default_16MB
m5stack-fire.build.defines=

m5stack-fire.menu.PSRAM.enabled=Enabled
m5stack-fire.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
m5stack-fire.menu.PSRAM.enabled.build.extra_libs=
m5stack-fire.menu.PSRAM.disabled=Disabled
m5stack-fire.menu.PSRAM.disabled.build.defines=
m5stack-fire.menu.PSRAM.disabled.build.extra_libs=

m5stack-fire.menu.PartitionScheme.default=Default (2 x 6.5 MB app, 3.6 MB SPIFFS)
m5stack-fire.menu.PartitionScheme.default.build.partitions=default_16MB
m5stack-fire.menu.PartitionScheme.default.upload.maximum_size=6553600
m5stack-fire.menu.PartitionScheme.large_spiffs=Large SPIFFS (7 MB)
m5stack-fire.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
m5stack-fire.menu.PartitionScheme.large_spiffs.upload.maximum_size=4685824

m5stack-fire.menu.UploadSpeed.921600=921600
m5stack-fire.menu.UploadSpeed.921600.upload.speed=921600
m5stack-fire.menu.UploadSpeed.115200=115200
m5stack-fire.menu.UploadSpeed.115200.upload.speed=115200
m5stack-fire.menu.UploadSpeed.256000.windows=256000
m5stack-fire.menu.UploadSpeed.256000.upload.speed=256000
m5stack-fire.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-fire.menu.UploadSpeed.230400=230400
m5stack-fire.menu.UploadSpeed.230400.upload.speed=230400
m5stack-fire.menu.UploadSpeed.460800.linux=460800
m5stack-fire.menu.UploadSpeed.460800.macosx=460800
m5stack-fire.menu.UploadSpeed.460800.upload.speed=460800
m5stack-fire.menu.UploadSpeed.512000.windows=512000
m5stack-fire.menu.UploadSpeed.512000.upload.speed=512000

m5stack-fire.menu.DebugLevel.none=None
m5stack-fire.menu.DebugLevel.none.build.code_debug=0
m5stack-fire.menu.DebugLevel.error=Error
m5stack-fire.menu.DebugLevel.error.build.code_debug=1
m5stack-fire.menu.DebugLevel.warn=Warn
m5stack-fire.menu.DebugLevel.warn.build.code_debug=2
m5stack-fire.menu.DebugLevel.info=Info
m5stack-fire.menu.DebugLevel.info.build.code_debug=3
m5stack-fire.menu.DebugLevel.debug=Debug
m5stack-fire.menu.DebugLevel.debug.build.code_debug=4
m5stack-fire.menu.DebugLevel.verbose=Verbose
m5stack-fire.menu.DebugLevel.verbose.build.code_debug=5

m5stack-fire.menu.EraseFlash.none=Disabled
m5stack-fire.menu.EraseFlash.none.upload.erase_cmd=
m5stack-fire.menu.EraseFlash.all=Enabled
m5stack-fire.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack-station.name=M5Stack-Station

m5stack-station.bootloader.tool=esptool_py
m5stack-station.bootloader.tool.default=esptool_py

m5stack-station.upload.tool=esptool_py
m5stack-station.upload.tool.default=esptool_py
m5stack-station.upload.tool.network=esp_ota

m5stack-station.upload.maximum_size=6553600
m5stack-station.upload.maximum_data_size=4521984
m5stack-station.upload.flags=
m5stack-station.upload.extra_flags=

m5stack-station.serial.disableDTR=true
m5stack-station.serial.disableRTS=true

m5stack-station.build.tarch=xtensa
m5stack-station.build.bootloader_addr=0x1000
m5stack-station.build.target=esp32
m5stack-station.build.mcu=esp32
m5stack-station.build.core=esp32
m5stack-station.build.variant=m5stack_station
m5stack-station.build.board=M5Stack_Station

m5stack-station.build.f_cpu=240000000L
m5stack-station.build.flash_size=16MB
m5stack-station.build.flash_freq=80m
m5stack-station.build.flash_mode=dio
m5stack-station.build.boot=dio
m5stack-station.build.partitions=default_16MB
m5stack-station.build.defines=

m5stack-station.menu.PartitionScheme.default=Default
m5stack-station.menu.PartitionScheme.default.build.partitions=default_16MB
m5stack-station.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-station.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-station.menu.PartitionScheme.no_ota.upload.maximum_size=6553600
m5stack-station.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-station.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-station.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-station.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack-station.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-station.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack-station.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-station.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack-station.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-station.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack-station.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-station.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack-station.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack-station.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack-station.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-station.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack-station.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack-station.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack-station.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack-station.menu.UploadSpeed.1500000=1500000
m5stack-station.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack-station.menu.UploadSpeed.750000=750000
m5stack-station.menu.UploadSpeed.750000.upload.speed=750000
m5stack-station.menu.UploadSpeed.500000=500000
m5stack-station.menu.UploadSpeed.500000.upload.speed=500000
m5stack-station.menu.UploadSpeed.250000=250000
m5stack-station.menu.UploadSpeed.250000.upload.speed=250000
m5stack-station.menu.UploadSpeed.115200=115200
m5stack-station.menu.UploadSpeed.115200.upload.speed=115200

