espressif/arduino-esp32/boards.txt
wifiduino32c3.menu.CPUFreq.160=160MHz (WiFi)
wifiduino32c3.menu.CPUFreq.160.build.f_cpu=160000000L
wifiduino32c3.menu.CPUFreq.80=80MHz (WiFi)
wifiduino32c3.menu.CPUFreq.80.build.f_cpu=80000000L
wifiduino32c3.menu.CPUFreq.40=40MHz
wifiduino32c3.menu.CPUFreq.40.build.f_cpu=40000000L
wifiduino32c3.menu.CPUFreq.20=20MHz
wifiduino32c3.menu.CPUFreq.20.build.f_cpu=20000000L
wifiduino32c3.menu.CPUFreq.10=10MHz
wifiduino32c3.menu.CPUFreq.10.build.f_cpu=10000000L

wifiduino32c3.menu.FlashMode.qio=QIO
wifiduino32c3.menu.FlashMode.qio.build.flash_mode=dio
wifiduino32c3.menu.FlashMode.qio.build.boot=qio
wifiduino32c3.menu.FlashMode.dio=DIO
wifiduino32c3.menu.FlashMode.dio.build.flash_mode=dio
wifiduino32c3.menu.FlashMode.dio.build.boot=dio

wifiduino32c3.menu.FlashFreq.80=80MHz
wifiduino32c3.menu.FlashFreq.80.build.flash_freq=80m
wifiduino32c3.menu.FlashFreq.40=40MHz
wifiduino32c3.menu.FlashFreq.40.build.flash_freq=40m

wifiduino32c3.menu.FlashSize.4M=4MB (32Mb)
wifiduino32c3.menu.FlashSize.4M.build.flash_size=4MB
wifiduino32c3.menu.FlashSize.8M=8MB (64Mb)
wifiduino32c3.menu.FlashSize.8M.build.flash_size=8MB
wifiduino32c3.menu.FlashSize.8M.build.partitions=default_8MB
wifiduino32c3.menu.FlashSize.2M=2MB (16Mb)
wifiduino32c3.menu.FlashSize.2M.build.flash_size=2MB
wifiduino32c3.menu.FlashSize.2M.build.partitions=minimal
wifiduino32c3.menu.FlashSize.16M=16MB (128Mb)
wifiduino32c3.menu.FlashSize.16M.build.flash_size=16MB

wifiduino32c3.menu.UploadSpeed.921600=921600
wifiduino32c3.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32c3.menu.UploadSpeed.115200=115200
wifiduino32c3.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32c3.menu.UploadSpeed.256000.windows=256000
wifiduino32c3.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32c3.menu.UploadSpeed.230400=230400
wifiduino32c3.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32c3.menu.UploadSpeed.460800.linux=460800
wifiduino32c3.menu.UploadSpeed.460800.macosx=460800
wifiduino32c3.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32c3.menu.UploadSpeed.512000.windows=512000
wifiduino32c3.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32c3.menu.DebugLevel.none=None
wifiduino32c3.menu.DebugLevel.none.build.code_debug=0
wifiduino32c3.menu.DebugLevel.error=Error
wifiduino32c3.menu.DebugLevel.error.build.code_debug=1
wifiduino32c3.menu.DebugLevel.warn=Warn
wifiduino32c3.menu.DebugLevel.warn.build.code_debug=2
wifiduino32c3.menu.DebugLevel.info=Info
wifiduino32c3.menu.DebugLevel.info.build.code_debug=3
wifiduino32c3.menu.DebugLevel.debug=Debug
wifiduino32c3.menu.DebugLevel.debug.build.code_debug=4
wifiduino32c3.menu.DebugLevel.verbose=Verbose
wifiduino32c3.menu.DebugLevel.verbose.build.code_debug=5

wifiduino32c3.menu.EraseFlash.none=Disabled
wifiduino32c3.menu.EraseFlash.none.upload.erase_cmd=
wifiduino32c3.menu.EraseFlash.all=Enabled
wifiduino32c3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wifiduino32s3.name=WiFiduino32S3
wifiduino32s3.vid.0=0x303a
wifiduino32s3.pid.0=0x1001

wifiduino32s3.bootloader.tool=esptool_py
wifiduino32s3.bootloader.tool.default=esptool_py

wifiduino32s3.upload.tool=esptool_py
wifiduino32s3.upload.tool.default=esptool_py
wifiduino32s3.upload.tool.network=esp_ota

wifiduino32s3.upload.maximum_size=1310720
wifiduino32s3.upload.maximum_data_size=327680
wifiduino32s3.upload.flags=
wifiduino32s3.upload.extra_flags=
wifiduino32s3.upload.use_1200bps_touch=false
wifiduino32s3.upload.wait_for_upload_port=false

wifiduino32s3.serial.disableDTR=false
wifiduino32s3.serial.disableRTS=false

wifiduino32s3.build.tarch=xtensa
wifiduino32s3.build.bootloader_addr=0x0
wifiduino32s3.build.target=esp32s3
wifiduino32s3.build.mcu=esp32s3
wifiduino32s3.build.core=esp32
wifiduino32s3.build.variant=wifiduino32s3
wifiduino32s3.build.board=WiFiduino32S3

wifiduino32s3.build.usb_mode=1
wifiduino32s3.build.cdc_on_boot=0
wifiduino32s3.build.msc_on_boot=0
wifiduino32s3.build.dfu_on_boot=0
wifiduino32s3.build.f_cpu=240000000L
wifiduino32s3.build.flash_size=4MB
wifiduino32s3.build.flash_freq=80m
wifiduino32s3.build.flash_mode=dio
wifiduino32s3.build.boot=qio
wifiduino32s3.build.boot_freq=80m
wifiduino32s3.build.partitions=default
wifiduino32s3.build.defines=
wifiduino32s3.build.loop_core=
wifiduino32s3.build.event_core=
wifiduino32s3.build.psram_type=qspi
wifiduino32s3.build.memory_type={build.boot}_{build.psram_type}

wifiduino32s3.menu.PSRAM.disabled=Disabled
wifiduino32s3.menu.PSRAM.disabled.build.defines=
wifiduino32s3.menu.PSRAM.disabled.build.psram_type=qspi
wifiduino32s3.menu.PSRAM.enabled=QSPI PSRAM
wifiduino32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
wifiduino32s3.menu.PSRAM.enabled.build.psram_type=qspi
wifiduino32s3.menu.PSRAM.opi=OPI PSRAM
wifiduino32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
wifiduino32s3.menu.PSRAM.opi.build.psram_type=opi

wifiduino32s3.menu.FlashMode.qio=QIO 80MHz
wifiduino32s3.menu.FlashMode.qio.build.flash_mode=dio
wifiduino32s3.menu.FlashMode.qio.build.boot=qio
wifiduino32s3.menu.FlashMode.qio.build.boot_freq=80m
wifiduino32s3.menu.FlashMode.qio.build.flash_freq=80m
wifiduino32s3.menu.FlashMode.qio120=QIO 120MHz
wifiduino32s3.menu.FlashMode.qio120.build.flash_mode=dio
wifiduino32s3.menu.FlashMode.qio120.build.boot=qio
wifiduino32s3.menu.FlashMode.qio120.build.boot_freq=120m
wifiduino32s3.menu.FlashMode.qio120.build.flash_freq=80m
wifiduino32s3.menu.FlashMode.dio=DIO 80MHz
wifiduino32s3.menu.FlashMode.dio.build.flash_mode=dio
wifiduino32s3.menu.FlashMode.dio.build.boot=dio
wifiduino32s3.menu.FlashMode.dio.build.boot_freq=80m
wifiduino32s3.menu.FlashMode.dio.build.flash_freq=80m
wifiduino32s3.menu.FlashMode.opi=OPI 80MHz
wifiduino32s3.menu.FlashMode.opi.build.flash_mode=dout
wifiduino32s3.menu.FlashMode.opi.build.boot=opi
wifiduino32s3.menu.FlashMode.opi.build.boot_freq=80m
wifiduino32s3.menu.FlashMode.opi.build.flash_freq=80m

wifiduino32s3.menu.FlashSize.4M=4MB (32Mb)
wifiduino32s3.menu.FlashSize.4M.build.flash_size=4MB
wifiduino32s3.menu.FlashSize.8M=8MB (64Mb)
wifiduino32s3.menu.FlashSize.8M.build.flash_size=8MB
wifiduino32s3.menu.FlashSize.8M.build.partitions=default_8MB
wifiduino32s3.menu.FlashSize.16M=16MB (128Mb)
wifiduino32s3.menu.FlashSize.16M.build.flash_size=16MB
#wifiduino32s3.menu.FlashSize.32M=32MB (256Mb)
#wifiduino32s3.menu.FlashSize.32M.build.flash_size=32MB

wifiduino32s3.menu.LoopCore.1=Core 1
wifiduino32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wifiduino32s3.menu.LoopCore.0=Core 0
wifiduino32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wifiduino32s3.menu.EventsCore.1=Core 1
wifiduino32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wifiduino32s3.menu.EventsCore.0=Core 0
wifiduino32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

wifiduino32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
wifiduino32s3.menu.USBMode.hwcdc.build.usb_mode=1
wifiduino32s3.menu.USBMode.default=USB-OTG (TinyUSB)
wifiduino32s3.menu.USBMode.default.build.usb_mode=0

wifiduino32s3.menu.CDCOnBoot.default=Disabled
wifiduino32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
wifiduino32s3.menu.CDCOnBoot.cdc=Enabled
wifiduino32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wifiduino32s3.menu.MSCOnBoot.default=Disabled
wifiduino32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
wifiduino32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
wifiduino32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

wifiduino32s3.menu.DFUOnBoot.default=Disabled
wifiduino32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
wifiduino32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
wifiduino32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

