espressif/arduino-esp32/boards.txt
esp32-trueverit-iot-driver-mkii.menu.EraseFlash.none=Disabled
esp32-trueverit-iot-driver-mkii.menu.EraseFlash.none.upload.erase_cmd=
esp32-trueverit-iot-driver-mkii.menu.EraseFlash.all=Enabled
esp32-trueverit-iot-driver-mkii.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

atmegazero_esp32s2.name=ATMegaZero ESP32-S2
atmegazero_esp32s2.vid.0=0x239A
atmegazero_esp32s2.pid.0=0x800A

atmegazero_esp32s2.bootloader.tool=esptool_py
atmegazero_esp32s2.bootloader.tool.default=esptool_py

atmegazero_esp32s2.upload.tool=esptool_py
atmegazero_esp32s2.upload.tool.default=esptool_py
atmegazero_esp32s2.upload.tool.network=esp_ota

atmegazero_esp32s2.upload.maximum_size=1310720
atmegazero_esp32s2.upload.maximum_data_size=327680
atmegazero_esp32s2.upload.flags=
atmegazero_esp32s2.upload.extra_flags=
atmegazero_esp32s2.upload.use_1200bps_touch=true
atmegazero_esp32s2.upload.wait_for_upload_port=true

atmegazero_esp32s2.serial.disableDTR=false
atmegazero_esp32s2.serial.disableRTS=false

atmegazero_esp32s2.build.tarch=xtensa
atmegazero_esp32s2.build.bootloader_addr=0x1000
atmegazero_esp32s2.build.target=esp32s2
atmegazero_esp32s2.build.mcu=esp32s2
atmegazero_esp32s2.build.core=esp32
atmegazero_esp32s2.build.variant=atmegazero_esp32s2
atmegazero_esp32s2.build.board=atmegazero_esp32s2

atmegazero_esp32s2.build.cdc_on_boot=1
atmegazero_esp32s2.build.msc_on_boot=0
atmegazero_esp32s2.build.dfu_on_boot=0
atmegazero_esp32s2.build.serial=0
atmegazero_esp32s2.build.f_cpu=240000000L
atmegazero_esp32s2.build.flash_size=16MB
atmegazero_esp32s2.build.flash_freq=40m
atmegazero_esp32s2.build.flash_mode=qio
atmegazero_esp32s2.build.boot=qio
atmegazero_esp32s2.build.partitions=default
atmegazero_esp32s2.build.defines=

atmegazero_esp32s2.menu.CDCOnBoot.cdc=Enabled
atmegazero_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
atmegazero_esp32s2.menu.CDCOnBoot.default=Disabled
atmegazero_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0

atmegazero_esp32s2.menu.MSCOnBoot.default=Disabled
atmegazero_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
atmegazero_esp32s2.menu.MSCOnBoot.msc=Enabled
atmegazero_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

atmegazero_esp32s2.menu.DFUOnBoot.default=Disabled
atmegazero_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
atmegazero_esp32s2.menu.DFUOnBoot.dfu=Enabled
atmegazero_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

atmegazero_esp32s2.menu.PSRAM.disabled=Disabled
atmegazero_esp32s2.menu.PSRAM.disabled.build.defines=
atmegazero_esp32s2.menu.PSRAM.enabled=Enabled
atmegazero_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

atmegazero_esp32s2.menu.PartitionScheme.tinyuf2=TinyUF2 16MB (2MB APP/11.6MB FFAT)
atmegazero_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
atmegazero_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-16MB-tinyuf2
atmegazero_esp32s2.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
atmegazero_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.default.build.partitions=default
atmegazero_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
atmegazero_esp32s2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
atmegazero_esp32s2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
atmegazero_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
atmegazero_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
atmegazero_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
atmegazero_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
atmegazero_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
atmegazero_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
atmegazero_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
atmegazero_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
atmegazero_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
atmegazero_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
atmegazero_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
atmegazero_esp32s2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.fatflash.build.partitions=ffat
atmegazero_esp32s2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
atmegazero_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

atmegazero_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
atmegazero_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
atmegazero_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
atmegazero_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
atmegazero_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
atmegazero_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
atmegazero_esp32s2.menu.CPUFreq.40=40MHz
atmegazero_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
atmegazero_esp32s2.menu.CPUFreq.20=20MHz
atmegazero_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
atmegazero_esp32s2.menu.CPUFreq.10=10MHz
atmegazero_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

atmegazero_esp32s2.menu.FlashMode.qio=QIO
atmegazero_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
atmegazero_esp32s2.menu.FlashMode.qio.build.boot=qio
atmegazero_esp32s2.menu.FlashMode.dio=DIO
atmegazero_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
atmegazero_esp32s2.menu.FlashMode.dio.build.boot=dio

