espressif/arduino-esp32/boards.txt
nebulas3.menu.UploadSpeed.921600=921600
nebulas3.menu.UploadSpeed.921600.upload.speed=921600
nebulas3.menu.UploadSpeed.115200=115200
nebulas3.menu.UploadSpeed.115200.upload.speed=115200
nebulas3.menu.UploadSpeed.256000.windows=256000
nebulas3.menu.UploadSpeed.256000.upload.speed=256000
nebulas3.menu.UploadSpeed.230400.windows.upload.speed=256000
nebulas3.menu.UploadSpeed.230400=230400
nebulas3.menu.UploadSpeed.230400.upload.speed=230400
nebulas3.menu.UploadSpeed.460800.linux=460800
nebulas3.menu.UploadSpeed.460800.macosx=460800
nebulas3.menu.UploadSpeed.460800.upload.speed=460800
nebulas3.menu.UploadSpeed.512000.windows=512000
nebulas3.menu.UploadSpeed.512000.upload.speed=512000

nebulas3.menu.DebugLevel.none=None
nebulas3.menu.DebugLevel.none.build.code_debug=0
nebulas3.menu.DebugLevel.error=Error
nebulas3.menu.DebugLevel.error.build.code_debug=1
nebulas3.menu.DebugLevel.warn=Warn
nebulas3.menu.DebugLevel.warn.build.code_debug=2
nebulas3.menu.DebugLevel.info=Info
nebulas3.menu.DebugLevel.info.build.code_debug=3
nebulas3.menu.DebugLevel.debug=Debug
nebulas3.menu.DebugLevel.debug.build.code_debug=4
nebulas3.menu.DebugLevel.verbose=Verbose
nebulas3.menu.DebugLevel.verbose.build.code_debug=5

nebulas3.menu.EraseFlash.none=Disabled
nebulas3.menu.EraseFlash.none.upload.erase_cmd=
nebulas3.menu.EraseFlash.all=Enabled
nebulas3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lionbits3.name=Lion:Bit S3 STEM Dev Board
lionbits3.vid.0=0x303a
lionbits3.pid.0=0x1001

lionbits3.bootloader.tool=esptool_py
lionbits3.bootloader.tool.default=esptool_py

lionbits3.upload.tool=esptool_py
lionbits3.upload.tool.default=esptool_py
lionbits3.upload.tool.network=esp_ota

lionbits3.upload.maximum_size=1310720
lionbits3.upload.maximum_data_size=327680
lionbits3.upload.flags=
lionbits3.upload.extra_flags=
lionbits3.upload.use_1200bps_touch=false
lionbits3.upload.wait_for_upload_port=false

lionbits3.serial.disableDTR=false
lionbits3.serial.disableRTS=false

lionbits3.build.tarch=xtensa
lionbits3.build.bootloader_addr=0x0
lionbits3.build.target=esp32s3
lionbits3.build.mcu=esp32s3
lionbits3.build.core=esp32
lionbits3.build.variant=lionbits3
lionbits3.build.board=LIONBITS3_DEV


lionbits3.build.usb_mode=1
lionbits3.build.cdc_on_boot=0
lionbits3.build.msc_on_boot=0
lionbits3.build.dfu_on_boot=0
lionbits3.build.f_cpu=240000000L
lionbits3.build.flash_size=4MB
lionbits3.build.flash_freq=80m
lionbits3.build.flash_mode=dio
lionbits3.build.boot=qio
lionbits3.build.boot_freq=80m
lionbits3.build.partitions=default
lionbits3.build.defines=
lionbits3.build.loop_core=
lionbits3.build.event_core=
lionbits3.build.psram_type=qspi
lionbits3.build.memory_type={build.boot}_{build.psram_type}


lionbits3.menu.JTAGAdapter.default=Disabled
lionbits3.menu.JTAGAdapter.default.build.copy_jtag_files=0
lionbits3.menu.JTAGAdapter.builtin=Integrated USB JTAG
lionbits3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
lionbits3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
lionbits3.menu.JTAGAdapter.external=FTDI Adapter
lionbits3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
lionbits3.menu.JTAGAdapter.external.build.copy_jtag_files=1
lionbits3.menu.JTAGAdapter.bridge=ESP USB Bridge
lionbits3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
lionbits3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

lionbits3.menu.PSRAM.disabled=Disabled
lionbits3.menu.PSRAM.disabled.build.defines=
lionbits3.menu.PSRAM.disabled.build.psram_type=qspi
lionbits3.menu.PSRAM.enabled=QSPI PSRAM
lionbits3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
lionbits3.menu.PSRAM.enabled.build.psram_type=qspi
lionbits3.menu.PSRAM.opi=OPI PSRAM
lionbits3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
lionbits3.menu.PSRAM.opi.build.psram_type=opi

lionbits3.menu.FlashMode.qio=QIO 80MHz
lionbits3.menu.FlashMode.qio.build.flash_mode=dio
lionbits3.menu.FlashMode.qio.build.boot=qio
lionbits3.menu.FlashMode.qio.build.boot_freq=80m
lionbits3.menu.FlashMode.qio.build.flash_freq=80m
lionbits3.menu.FlashMode.qio120=QIO 120MHz
lionbits3.menu.FlashMode.qio120.build.flash_mode=dio
lionbits3.menu.FlashMode.qio120.build.boot=qio
lionbits3.menu.FlashMode.qio120.build.boot_freq=120m
lionbits3.menu.FlashMode.qio120.build.flash_freq=80m
lionbits3.menu.FlashMode.dio=DIO 80MHz
lionbits3.menu.FlashMode.dio.build.flash_mode=dio
lionbits3.menu.FlashMode.dio.build.boot=dio
lionbits3.menu.FlashMode.dio.build.boot_freq=80m
lionbits3.menu.FlashMode.dio.build.flash_freq=80m
lionbits3.menu.FlashMode.opi=OPI 80MHz
lionbits3.menu.FlashMode.opi.build.flash_mode=dout
lionbits3.menu.FlashMode.opi.build.boot=opi
lionbits3.menu.FlashMode.opi.build.boot_freq=80m
lionbits3.menu.FlashMode.opi.build.flash_freq=80m

lionbits3.menu.FlashSize.4M=4MB (32Mb)
lionbits3.menu.FlashSize.4M.build.flash_size=4MB
lionbits3.menu.FlashSize.8M=8MB (64Mb)
lionbits3.menu.FlashSize.8M.build.flash_size=8MB
lionbits3.menu.FlashSize.8M.build.partitions=default_8MB
lionbits3.menu.FlashSize.16M=16MB (128Mb)
lionbits3.menu.FlashSize.16M.build.flash_size=16MB
#lionbits3.menu.FlashSize.32M=32MB (256Mb)
#lionbits3.menu.FlashSize.32M.build.flash_size=32MB

lionbits3.menu.LoopCore.1=Core 1
lionbits3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
lionbits3.menu.LoopCore.0=Core 0
lionbits3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

lionbits3.menu.EventsCore.1=Core 1
lionbits3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lionbits3.menu.EventsCore.0=Core 0
lionbits3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lionbits3.menu.USBMode.hwcdc=Hardware CDC and JTAG
lionbits3.menu.USBMode.hwcdc.build.usb_mode=1
lionbits3.menu.USBMode.default=USB-OTG (TinyUSB)
lionbits3.menu.USBMode.default.build.usb_mode=0

lionbits3.menu.CDCOnBoot.default=Disabled
lionbits3.menu.CDCOnBoot.default.build.cdc_on_boot=0
lionbits3.menu.CDCOnBoot.cdc=Enabled
lionbits3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

