espressif/arduino-esp32/boards.txt
namino_rosso.menu.CPUFreq.240=240MHz (WiFi)
namino_rosso.menu.CPUFreq.240.build.f_cpu=240000000L
namino_rosso.menu.CPUFreq.160=160MHz (WiFi)
namino_rosso.menu.CPUFreq.160.build.f_cpu=160000000L
namino_rosso.menu.CPUFreq.80=80MHz (WiFi)
namino_rosso.menu.CPUFreq.80.build.f_cpu=80000000L
namino_rosso.menu.CPUFreq.40=40MHz
namino_rosso.menu.CPUFreq.40.build.f_cpu=40000000L
namino_rosso.menu.CPUFreq.20=20MHz
namino_rosso.menu.CPUFreq.20.build.f_cpu=20000000L
namino_rosso.menu.CPUFreq.10=10MHz
namino_rosso.menu.CPUFreq.10.build.f_cpu=10000000L

namino_rosso.menu.FlashMode.qio=QIO 80MHz
namino_rosso.menu.FlashMode.qio.build.flash_mode=dio
namino_rosso.menu.FlashMode.qio.build.boot=qio
namino_rosso.menu.FlashMode.qio.build.boot_freq=80m
namino_rosso.menu.FlashMode.qio.build.flash_freq=80m
namino_rosso.menu.FlashMode.qio120=QIO 120MHz
namino_rosso.menu.FlashMode.qio120.build.flash_mode=dio
namino_rosso.menu.FlashMode.qio120.build.boot=qio
namino_rosso.menu.FlashMode.qio120.build.boot_freq=120m
namino_rosso.menu.FlashMode.qio120.build.flash_freq=80m
namino_rosso.menu.FlashMode.dio=DIO 80MHz
namino_rosso.menu.FlashMode.dio.build.flash_mode=dio
namino_rosso.menu.FlashMode.dio.build.boot=dio
namino_rosso.menu.FlashMode.dio.build.boot_freq=80m
namino_rosso.menu.FlashMode.dio.build.flash_freq=80m
namino_rosso.menu.FlashMode.opi=OPI 80MHz
namino_rosso.menu.FlashMode.opi.build.flash_mode=dout
namino_rosso.menu.FlashMode.opi.build.boot=opi
namino_rosso.menu.FlashMode.opi.build.boot_freq=80m
namino_rosso.menu.FlashMode.opi.build.flash_freq=80m

namino_rosso.menu.FlashSize.4M=4MB (32Mb)
namino_rosso.menu.FlashSize.4M.build.flash_size=4MB

namino_rosso.menu.UploadSpeed.921600=921600
namino_rosso.menu.UploadSpeed.921600.upload.speed=921600
namino_rosso.menu.UploadSpeed.115200=115200
namino_rosso.menu.UploadSpeed.115200.upload.speed=115200
namino_rosso.menu.UploadSpeed.256000.windows=256000
namino_rosso.menu.UploadSpeed.256000.upload.speed=256000
namino_rosso.menu.UploadSpeed.230400.windows.upload.speed=256000
namino_rosso.menu.UploadSpeed.230400=230400
namino_rosso.menu.UploadSpeed.230400.upload.speed=230400
namino_rosso.menu.UploadSpeed.460800.linux=460800
namino_rosso.menu.UploadSpeed.460800.macosx=460800
namino_rosso.menu.UploadSpeed.460800.upload.speed=460800
namino_rosso.menu.UploadSpeed.512000.windows=512000
namino_rosso.menu.UploadSpeed.512000.upload.speed=512000

namino_rosso.menu.DebugLevel.none=None
namino_rosso.menu.DebugLevel.none.build.code_debug=0
namino_rosso.menu.DebugLevel.error=Error
namino_rosso.menu.DebugLevel.error.build.code_debug=1
namino_rosso.menu.DebugLevel.warn=Warn
namino_rosso.menu.DebugLevel.warn.build.code_debug=2
namino_rosso.menu.DebugLevel.info=Info
namino_rosso.menu.DebugLevel.info.build.code_debug=3
namino_rosso.menu.DebugLevel.debug=Debug
namino_rosso.menu.DebugLevel.debug.build.code_debug=4
namino_rosso.menu.DebugLevel.verbose=Verbose
namino_rosso.menu.DebugLevel.verbose.build.code_debug=5

namino_rosso.menu.EraseFlash.none=Disabled
namino_rosso.menu.EraseFlash.none.upload.erase_cmd=
namino_rosso.menu.EraseFlash.all=Enabled
namino_rosso.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Namino Arancio

namino_arancio.name=Namino Arancio
namino_arancio.vid.0=0x303a
namino_arancio.pid.0=0x1001

namino_arancio.bootloader.tool=esptool_py
namino_arancio.bootloader.tool.default=esptool_py

namino_arancio.upload.tool=esptool_py
namino_arancio.upload.tool.default=esptool_py
namino_arancio.upload.tool.network=esp_ota

namino_arancio.upload.maximum_size=1310720
namino_arancio.upload.maximum_data_size=327680
namino_arancio.upload.flags=
namino_arancio.upload.extra_flags=
namino_arancio.upload.use_1200bps_touch=true
namino_arancio.upload.wait_for_upload_port=true

namino_arancio.serial.disableDTR=false
namino_arancio.serial.disableRTS=false

namino_arancio.build.tarch=xtensa
namino_arancio.build.bootloader_addr=0x0
namino_arancio.build.target=esp32s3
namino_arancio.build.mcu=esp32s3
namino_arancio.build.core=esp32
namino_arancio.build.variant=namino_arancio
namino_arancio.build.board=NAMINO_ARANCIO

namino_arancio.build.usb_mode=0
namino_arancio.build.cdc_on_boot=1
namino_arancio.build.msc_on_boot=0
namino_arancio.build.dfu_on_boot=0
namino_arancio.build.f_cpu=240000000L
namino_arancio.build.flash_size=4MB
namino_arancio.build.flash_freq=80m
namino_arancio.build.flash_mode=dio
namino_arancio.build.boot=qio
namino_arancio.build.partitions=default
namino_arancio.build.defines=
namino_arancio.build.loop_core=
namino_arancio.build.event_core=
namino_arancio.build.flash_type=qio
namino_arancio.build.psram_type=qspi
namino_arancio.build.memory_type={build.flash_type}_{build.psram_type}

namino_arancio.menu.LoopCore.1=Core 1
namino_arancio.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
namino_arancio.menu.LoopCore.0=Core 0
namino_arancio.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

namino_arancio.menu.EventsCore.1=Core 1
namino_arancio.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
namino_arancio.menu.EventsCore.0=Core 0
namino_arancio.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

namino_arancio.menu.USBMode.default=USB-OTG (TinyUSB)
namino_arancio.menu.USBMode.default.build.usb_mode=0
namino_arancio.menu.USBMode.hwcdc=Hardware CDC and JTAG
namino_arancio.menu.USBMode.hwcdc.build.usb_mode=1

namino_arancio.menu.CDCOnBoot.cdc=Enabled
namino_arancio.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
namino_arancio.menu.CDCOnBoot.default=Disabled
namino_arancio.menu.CDCOnBoot.default.build.cdc_on_boot=0

namino_arancio.menu.MSCOnBoot.default=Disabled
namino_arancio.menu.MSCOnBoot.default.build.msc_on_boot=0
namino_arancio.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
namino_arancio.menu.MSCOnBoot.msc.build.msc_on_boot=1

namino_arancio.menu.DFUOnBoot.default=Disabled
namino_arancio.menu.DFUOnBoot.default.build.dfu_on_boot=0
namino_arancio.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
namino_arancio.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

