espressif/arduino-esp32/boards.txt
namino_arancio.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
namino_arancio.menu.UploadMode.cdc.upload.use_1200bps_touch=true
namino_arancio.menu.UploadMode.cdc.upload.wait_for_upload_port=true
namino_arancio.menu.UploadMode.default=UART0 / Hardware CDC
namino_arancio.menu.UploadMode.default.upload.use_1200bps_touch=false
namino_arancio.menu.UploadMode.default.upload.wait_for_upload_port=false

namino_arancio.menu.PSRAM.disabled=Disabled
namino_arancio.menu.PSRAM.disabled.build.defines=
namino_arancio.menu.PSRAM.disabled.build.psram_type=qspi
namino_arancio.menu.PSRAM.enabled=QSPI PSRAM
namino_arancio.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
namino_arancio.menu.PSRAM.enabled.build.psram_type=qspi
namino_arancio.menu.PSRAM.opi=OPI PSRAM
namino_arancio.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
namino_arancio.menu.PSRAM.opi.build.psram_type=opi

namino_arancio.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
namino_arancio.menu.PartitionScheme.default.build.partitions=default
namino_arancio.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
namino_arancio.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
namino_arancio.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
namino_arancio.menu.PartitionScheme.minimal.build.partitions=minimal
namino_arancio.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
namino_arancio.menu.PartitionScheme.no_ota.build.partitions=no_ota
namino_arancio.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
namino_arancio.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
namino_arancio.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
namino_arancio.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
namino_arancio.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
namino_arancio.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
namino_arancio.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
namino_arancio.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
namino_arancio.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
namino_arancio.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
namino_arancio.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
namino_arancio.menu.PartitionScheme.huge_app.build.partitions=huge_app
namino_arancio.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
namino_arancio.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
namino_arancio.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
namino_arancio.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

namino_arancio.menu.CPUFreq.240=240MHz (WiFi)
namino_arancio.menu.CPUFreq.240.build.f_cpu=240000000L
namino_arancio.menu.CPUFreq.160=160MHz (WiFi)
namino_arancio.menu.CPUFreq.160.build.f_cpu=160000000L
namino_arancio.menu.CPUFreq.80=80MHz (WiFi)
namino_arancio.menu.CPUFreq.80.build.f_cpu=80000000L
namino_arancio.menu.CPUFreq.40=40MHz
namino_arancio.menu.CPUFreq.40.build.f_cpu=40000000L
namino_arancio.menu.CPUFreq.20=20MHz
namino_arancio.menu.CPUFreq.20.build.f_cpu=20000000L
namino_arancio.menu.CPUFreq.10=10MHz
namino_arancio.menu.CPUFreq.10.build.f_cpu=10000000L

namino_arancio.menu.FlashMode.qio=QIO 80MHz
namino_arancio.menu.FlashMode.qio.build.flash_mode=dio
namino_arancio.menu.FlashMode.qio.build.boot=qio
namino_arancio.menu.FlashMode.qio.build.boot_freq=80m
namino_arancio.menu.FlashMode.qio.build.flash_freq=80m
namino_arancio.menu.FlashMode.qio120=QIO 120MHz
namino_arancio.menu.FlashMode.qio120.build.flash_mode=dio
namino_arancio.menu.FlashMode.qio120.build.boot=qio
namino_arancio.menu.FlashMode.qio120.build.boot_freq=120m
namino_arancio.menu.FlashMode.qio120.build.flash_freq=80m
namino_arancio.menu.FlashMode.dio=DIO 80MHz
namino_arancio.menu.FlashMode.dio.build.flash_mode=dio
namino_arancio.menu.FlashMode.dio.build.boot=dio
namino_arancio.menu.FlashMode.dio.build.boot_freq=80m
namino_arancio.menu.FlashMode.dio.build.flash_freq=80m
namino_arancio.menu.FlashMode.opi=OPI 80MHz
namino_arancio.menu.FlashMode.opi.build.flash_mode=dout
namino_arancio.menu.FlashMode.opi.build.boot=opi
namino_arancio.menu.FlashMode.opi.build.boot_freq=80m
namino_arancio.menu.FlashMode.opi.build.flash_freq=80m

namino_arancio.menu.FlashSize.4M=4MB (32Mb)
namino_arancio.menu.FlashSize.4M.build.flash_size=4MB

namino_arancio.menu.UploadSpeed.921600=921600
namino_arancio.menu.UploadSpeed.921600.upload.speed=921600
namino_arancio.menu.UploadSpeed.115200=115200
namino_arancio.menu.UploadSpeed.115200.upload.speed=115200
namino_arancio.menu.UploadSpeed.256000.windows=256000
namino_arancio.menu.UploadSpeed.256000.upload.speed=256000
namino_arancio.menu.UploadSpeed.230400.windows.upload.speed=256000
namino_arancio.menu.UploadSpeed.230400=230400
namino_arancio.menu.UploadSpeed.230400.upload.speed=230400
namino_arancio.menu.UploadSpeed.460800.linux=460800
namino_arancio.menu.UploadSpeed.460800.macosx=460800
namino_arancio.menu.UploadSpeed.460800.upload.speed=460800
namino_arancio.menu.UploadSpeed.512000.windows=512000
namino_arancio.menu.UploadSpeed.512000.upload.speed=512000

namino_arancio.menu.DebugLevel.none=None
namino_arancio.menu.DebugLevel.none.build.code_debug=0
namino_arancio.menu.DebugLevel.error=Error
namino_arancio.menu.DebugLevel.error.build.code_debug=1
namino_arancio.menu.DebugLevel.warn=Warn
namino_arancio.menu.DebugLevel.warn.build.code_debug=2
namino_arancio.menu.DebugLevel.info=Info
namino_arancio.menu.DebugLevel.info.build.code_debug=3
namino_arancio.menu.DebugLevel.debug=Debug
namino_arancio.menu.DebugLevel.debug.build.code_debug=4
namino_arancio.menu.DebugLevel.verbose=Verbose
namino_arancio.menu.DebugLevel.verbose.build.code_debug=5

namino_arancio.menu.EraseFlash.none=Disabled
namino_arancio.menu.EraseFlash.none.upload.erase_cmd=
namino_arancio.menu.EraseFlash.all=Enabled
namino_arancio.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Namino Bianco

namino_bianco.name=Namino Bianco
namino_bianco.vid.0=0x303a
namino_bianco.pid.0=0x1001

namino_bianco.bootloader.tool=esptool_py
namino_bianco.bootloader.tool.default=esptool_py

