espressif/arduino-esp32/boards.txt
namino_bianco.upload.tool=esptool_py
namino_bianco.upload.tool.default=esptool_py
namino_bianco.upload.tool.network=esp_ota

namino_bianco.upload.maximum_size=1310720
namino_bianco.upload.maximum_data_size=327680
namino_bianco.upload.flags=
namino_bianco.upload.extra_flags=
namino_bianco.upload.use_1200bps_touch=true
namino_bianco.upload.wait_for_upload_port=true

namino_bianco.serial.disableDTR=false
namino_bianco.serial.disableRTS=false

namino_bianco.build.tarch=xtensa
namino_bianco.build.bootloader_addr=0x0
namino_bianco.build.target=esp32s3
namino_bianco.build.mcu=esp32s3
namino_bianco.build.core=esp32
namino_bianco.build.variant=namino_bianco
namino_bianco.build.board=NAMINO_BIANCO

namino_bianco.build.usb_mode=0
namino_bianco.build.cdc_on_boot=1
namino_bianco.build.msc_on_boot=0
namino_bianco.build.dfu_on_boot=0
namino_bianco.build.f_cpu=240000000L
namino_bianco.build.flash_size=4MB
namino_bianco.build.flash_freq=80m
namino_bianco.build.flash_mode=dio
namino_bianco.build.boot=qio
namino_bianco.build.partitions=default
namino_bianco.build.defines=
namino_bianco.build.loop_core=
namino_bianco.build.event_core=
namino_bianco.build.flash_type=qio
namino_bianco.build.psram_type=qspi
namino_bianco.build.memory_type={build.flash_type}_{build.psram_type}

namino_bianco.menu.LoopCore.1=Core 1
namino_bianco.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
namino_bianco.menu.LoopCore.0=Core 0
namino_bianco.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

namino_bianco.menu.EventsCore.1=Core 1
namino_bianco.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
namino_bianco.menu.EventsCore.0=Core 0
namino_bianco.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

namino_bianco.menu.USBMode.default=USB-OTG (TinyUSB)
namino_bianco.menu.USBMode.default.build.usb_mode=0
namino_bianco.menu.USBMode.hwcdc=Hardware CDC and JTAG
namino_bianco.menu.USBMode.hwcdc.build.usb_mode=1

namino_bianco.menu.CDCOnBoot.cdc=Enabled
namino_bianco.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
namino_bianco.menu.CDCOnBoot.default=Disabled
namino_bianco.menu.CDCOnBoot.default.build.cdc_on_boot=0

namino_bianco.menu.MSCOnBoot.default=Disabled
namino_bianco.menu.MSCOnBoot.default.build.msc_on_boot=0
namino_bianco.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
namino_bianco.menu.MSCOnBoot.msc.build.msc_on_boot=1

namino_bianco.menu.DFUOnBoot.default=Disabled
namino_bianco.menu.DFUOnBoot.default.build.dfu_on_boot=0
namino_bianco.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
namino_bianco.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

namino_bianco.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
namino_bianco.menu.UploadMode.cdc.upload.use_1200bps_touch=true
namino_bianco.menu.UploadMode.cdc.upload.wait_for_upload_port=true
namino_bianco.menu.UploadMode.default=UART0 / Hardware CDC
namino_bianco.menu.UploadMode.default.upload.use_1200bps_touch=false
namino_bianco.menu.UploadMode.default.upload.wait_for_upload_port=false

namino_bianco.menu.PSRAM.disabled=Disabled
namino_bianco.menu.PSRAM.disabled.build.defines=
namino_bianco.menu.PSRAM.disabled.build.psram_type=qspi
namino_bianco.menu.PSRAM.enabled=QSPI PSRAM
namino_bianco.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
namino_bianco.menu.PSRAM.enabled.build.psram_type=qspi
namino_bianco.menu.PSRAM.opi=OPI PSRAM
namino_bianco.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
namino_bianco.menu.PSRAM.opi.build.psram_type=opi

namino_bianco.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
namino_bianco.menu.PartitionScheme.default.build.partitions=default
namino_bianco.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
namino_bianco.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
namino_bianco.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
namino_bianco.menu.PartitionScheme.minimal.build.partitions=minimal
namino_bianco.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
namino_bianco.menu.PartitionScheme.no_ota.build.partitions=no_ota
namino_bianco.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
namino_bianco.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
namino_bianco.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
namino_bianco.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
namino_bianco.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
namino_bianco.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
namino_bianco.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
namino_bianco.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
namino_bianco.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
namino_bianco.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
namino_bianco.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
namino_bianco.menu.PartitionScheme.huge_app.build.partitions=huge_app
namino_bianco.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
namino_bianco.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
namino_bianco.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
namino_bianco.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

namino_bianco.menu.CPUFreq.240=240MHz (WiFi)
namino_bianco.menu.CPUFreq.240.build.f_cpu=240000000L
namino_bianco.menu.CPUFreq.160=160MHz (WiFi)
namino_bianco.menu.CPUFreq.160.build.f_cpu=160000000L
namino_bianco.menu.CPUFreq.80=80MHz (WiFi)
namino_bianco.menu.CPUFreq.80.build.f_cpu=80000000L
namino_bianco.menu.CPUFreq.40=40MHz
namino_bianco.menu.CPUFreq.40.build.f_cpu=40000000L
namino_bianco.menu.CPUFreq.20=20MHz
namino_bianco.menu.CPUFreq.20.build.f_cpu=20000000L
namino_bianco.menu.CPUFreq.10=10MHz
namino_bianco.menu.CPUFreq.10.build.f_cpu=10000000L

namino_bianco.menu.FlashMode.qio=QIO 80MHz
namino_bianco.menu.FlashMode.qio.build.flash_mode=dio
namino_bianco.menu.FlashMode.qio.build.boot=qio
namino_bianco.menu.FlashMode.qio.build.boot_freq=80m
namino_bianco.menu.FlashMode.qio.build.flash_freq=80m
namino_bianco.menu.FlashMode.qio120=QIO 120MHz
namino_bianco.menu.FlashMode.qio120.build.flash_mode=dio
namino_bianco.menu.FlashMode.qio120.build.boot=qio
namino_bianco.menu.FlashMode.qio120.build.boot_freq=120m
namino_bianco.menu.FlashMode.qio120.build.flash_freq=80m
namino_bianco.menu.FlashMode.dio=DIO 80MHz
namino_bianco.menu.FlashMode.dio.build.flash_mode=dio
namino_bianco.menu.FlashMode.dio.build.boot=dio
namino_bianco.menu.FlashMode.dio.build.boot_freq=80m
namino_bianco.menu.FlashMode.dio.build.flash_freq=80m
namino_bianco.menu.FlashMode.opi=OPI 80MHz
namino_bianco.menu.FlashMode.opi.build.flash_mode=dout
namino_bianco.menu.FlashMode.opi.build.boot=opi
namino_bianco.menu.FlashMode.opi.build.boot_freq=80m
namino_bianco.menu.FlashMode.opi.build.flash_freq=80m

namino_bianco.menu.FlashSize.4M=4MB (32Mb)
namino_bianco.menu.FlashSize.4M.build.flash_size=4MB

namino_bianco.menu.UploadSpeed.921600=921600
namino_bianco.menu.UploadSpeed.921600.upload.speed=921600
namino_bianco.menu.UploadSpeed.115200=115200
namino_bianco.menu.UploadSpeed.115200.upload.speed=115200
namino_bianco.menu.UploadSpeed.256000.windows=256000
namino_bianco.menu.UploadSpeed.256000.upload.speed=256000
namino_bianco.menu.UploadSpeed.230400.windows.upload.speed=256000
namino_bianco.menu.UploadSpeed.230400=230400
namino_bianco.menu.UploadSpeed.230400.upload.speed=230400
namino_bianco.menu.UploadSpeed.460800.linux=460800
namino_bianco.menu.UploadSpeed.460800.macosx=460800
namino_bianco.menu.UploadSpeed.460800.upload.speed=460800
namino_bianco.menu.UploadSpeed.512000.windows=512000
namino_bianco.menu.UploadSpeed.512000.upload.speed=512000

