espressif/arduino-esp32/boards.txt
ioxesp32ps.build.f_cpu=240000000L
ioxesp32ps.build.flash_mode=dio
ioxesp32ps.build.flash_size=4MB
ioxesp32ps.build.flash_freq=40m
ioxesp32ps.build.boot=dio
ioxesp32ps.build.partitions=default
ioxesp32ps.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
ioxesp32ps.build.extra_libs=

ioxesp32ps.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.default.build.partitions=default
ioxesp32ps.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ioxesp32ps.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ioxesp32ps.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
ioxesp32ps.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
ioxesp32ps.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ioxesp32ps.menu.PartitionScheme.minimal.build.partitions=minimal
ioxesp32ps.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.no_ota.build.partitions=no_ota
ioxesp32ps.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ioxesp32ps.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ioxesp32ps.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ioxesp32ps.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ioxesp32ps.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ioxesp32ps.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ioxesp32ps.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ioxesp32ps.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ioxesp32ps.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ioxesp32ps.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.huge_app.build.partitions=huge_app
ioxesp32ps.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ioxesp32ps.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ioxesp32ps.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ioxesp32ps.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ioxesp32ps.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
ioxesp32ps.menu.PartitionScheme.fatflash.build.partitions=ffat
ioxesp32ps.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
ioxesp32ps.menu.PartitionScheme.rainmaker=RainMaker
ioxesp32ps.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
ioxesp32ps.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

ioxesp32ps.menu.FlashFreq.80=80MHz
ioxesp32ps.menu.FlashFreq.80.build.flash_freq=80m
ioxesp32ps.menu.FlashFreq.40=40MHz
ioxesp32ps.menu.FlashFreq.40.build.flash_freq=40m

ioxesp32ps.menu.UploadSpeed.921600=921600
ioxesp32ps.menu.UploadSpeed.921600.upload.speed=921600
ioxesp32ps.menu.UploadSpeed.115200=115200
ioxesp32ps.menu.UploadSpeed.115200.upload.speed=115200
ioxesp32ps.menu.UploadSpeed.256000.windows=256000
ioxesp32ps.menu.UploadSpeed.256000.upload.speed=256000
ioxesp32ps.menu.UploadSpeed.230400.windows.upload.speed=256000
ioxesp32ps.menu.UploadSpeed.230400=230400
ioxesp32ps.menu.UploadSpeed.230400.upload.speed=230400
ioxesp32ps.menu.UploadSpeed.460800.linux=460800
ioxesp32ps.menu.UploadSpeed.460800.macosx=460800
ioxesp32ps.menu.UploadSpeed.460800.upload.speed=460800
ioxesp32ps.menu.UploadSpeed.512000.windows=512000
ioxesp32ps.menu.UploadSpeed.512000.upload.speed=512000

ioxesp32ps.menu.DebugLevel.none=None
ioxesp32ps.menu.DebugLevel.none.build.code_debug=0
ioxesp32ps.menu.DebugLevel.error=Error
ioxesp32ps.menu.DebugLevel.error.build.code_debug=1
ioxesp32ps.menu.DebugLevel.warn=Warn
ioxesp32ps.menu.DebugLevel.warn.build.code_debug=2
ioxesp32ps.menu.DebugLevel.info=Info
ioxesp32ps.menu.DebugLevel.info.build.code_debug=3
ioxesp32ps.menu.DebugLevel.debug=Debug
ioxesp32ps.menu.DebugLevel.debug.build.code_debug=4
ioxesp32ps.menu.DebugLevel.verbose=Verbose
ioxesp32ps.menu.DebugLevel.verbose.build.code_debug=5

ioxesp32ps.menu.EraseFlash.none=Disabled
ioxesp32ps.menu.EraseFlash.none.upload.erase_cmd=
ioxesp32ps.menu.EraseFlash.all=Enabled
ioxesp32ps.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

atd147_s3.name=ATD1.47-S3
atd147_s3.vid.0=0x303a
atd147_s3.pid.0=0x1001

atd147_s3.bootloader.tool=esptool_py
atd147_s3.bootloader.tool.default=esptool_py

atd147_s3.upload.tool=esptool_py
atd147_s3.upload.tool.default=esptool_py
atd147_s3.upload.tool.network=esp_ota

atd147_s3.upload.maximum_size=1310720
atd147_s3.upload.maximum_data_size=327680
atd147_s3.upload.flags=
atd147_s3.upload.extra_flags=
atd147_s3.upload.use_1200bps_touch=false
atd147_s3.upload.wait_for_upload_port=false

atd147_s3.serial.disableDTR=false
atd147_s3.serial.disableRTS=false

atd147_s3.build.tarch=xtensa
atd147_s3.build.bootloader_addr=0x0
atd147_s3.build.target=esp32s3
atd147_s3.build.mcu=esp32s3
atd147_s3.build.core=esp32
atd147_s3.build.variant=atd147_s3
atd147_s3.build.board=ATD143_S3

atd147_s3.build.usb_mode=1
atd147_s3.build.cdc_on_boot=0
atd147_s3.build.msc_on_boot=0
atd147_s3.build.dfu_on_boot=0
atd147_s3.build.f_cpu=240000000L
atd147_s3.build.flash_size=8MB
atd147_s3.build.flash_freq=80m
atd147_s3.build.flash_mode=dio
atd147_s3.build.boot=qio
atd147_s3.build.boot_freq=80m
atd147_s3.build.partitions=default_8MB
atd147_s3.build.defines=
atd147_s3.build.loop_core=
atd147_s3.build.event_core=
atd147_s3.build.psram_type=opi
atd147_s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
atd147_s3.menu.JTAGAdapter.default=Disabled
atd147_s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
atd147_s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
atd147_s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
atd147_s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
atd147_s3.menu.JTAGAdapter.external=FTDI Adapter
atd147_s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
atd147_s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
atd147_s3.menu.JTAGAdapter.bridge=ESP USB Bridge
atd147_s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
atd147_s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

